# Transitive closure in Neo4j

Example dataset:

```
CREATE
  (a:Node {name: 'a'}),
  (b:Node {name: 'b'}),
  (c:Node {name: 'c'}),
  (d:Node {name: 'd'}),
  (e:Node {name: 'e'}),
  (a)-[:REL {x: 1}]->(b)-[:REL {x: 2}]->(c)-[:REL {x: 3}]->(d)-[:REL {x: 4}]->(c),
  (b)-[:REL {x: 5}]->(c),
  (b)-[:REL {x: 6}]->(e)-[:REL {x: 7}]->(c)
```

### Query with unlimited hops - basic path

```
MATCH p=( (a {name: 'a'})-[r:REL*]->(c {name: 'c'}) )
RETURN r, p
ORDER BY length(r)
```

```
╒════════════════════════════════════════╤══════════════════════════════════════════════════════════════════════════════════════════════════════════╕
│r                                       │p                                                                                                         │
╞════════════════════════════════════════╪══════════════════════════════════════════════════════════════════════════════════════════════════════════╡
│[{x: 1}, {x: 2}]                        │[{name: a}, {x: 1}, {name: b}, {x: 2}, {name: c}]                                                         │
├────────────────────────────────────────┼──────────────────────────────────────────────────────────────────────────────────────────────────────────┤
│[{x: 1}, {x: 5}]                        │[{name: a}, {x: 1}, {name: b}, {x: 5}, {name: c}]                                                         │
├────────────────────────────────────────┼──────────────────────────────────────────────────────────────────────────────────────────────────────────┤
│[{x: 1}, {x: 6}, {x: 7}]                │[{name: a}, {x: 1}, {name: b}, {x: 6}, {name: e}, {x: 7}, {name: c}]                                      │
├────────────────────────────────────────┼──────────────────────────────────────────────────────────────────────────────────────────────────────────┤
│[{x: 1}, {x: 2}, {x: 3}, {x: 4}]        │[{name: a}, {x: 1}, {name: b}, {x: 2}, {name: c}, {x: 3}, {name: d}, {x: 4}, {name: c}]                   │
├────────────────────────────────────────┼──────────────────────────────────────────────────────────────────────────────────────────────────────────┤
│[{x: 1}, {x: 5}, {x: 3}, {x: 4}]        │[{name: a}, {x: 1}, {name: b}, {x: 5}, {name: c}, {x: 3}, {name: d}, {x: 4}, {name: c}]                   │
├────────────────────────────────────────┼──────────────────────────────────────────────────────────────────────────────────────────────────────────┤
│[{x: 1}, {x: 6}, {x: 7}, {x: 3}, {x: 4}]│[{name: a}, {x: 1}, {name: b}, {x: 6}, {name: e}, {x: 7}, {name: c}, {x: 3}, {name: d}, {x: 4}, {name: c}]│
└────────────────────────────────────────┴──────────────────────────────────────────────────────────────────────────────────────────────────────────┘
```

### Query for shortest path

```
MATCH p=shortestPath( (a {name: 'a'})-[r:REL*]->(c {name: 'c'}) )
RETURN r, p
ORDER BY length(r)
```

Result:

```
╒════════════════╤═════════════════════════════════════════════════╕
│r               │p                                                │
╞════════════════╪═════════════════════════════════════════════════╡
│[{x: 1}, {x: 5}]│[{name: a}, {x: 1}, {name: b}, {x: 5}, {name: c}]│
└────────────────┴─────────────────────────────────────────────────┘
```

### Query for all shortest paths - shortestPath

```
MATCH p=allShortestPaths( (a {name: 'a'})-[r:REL*]->(c {name: 'c'}) )
RETURN r, p
ORDER BY length(r)
```

```
╒════════════════╤═════════════════════════════════════════════════╕
│r               │p                                                │
╞════════════════╪═════════════════════════════════════════════════╡
│[{x: 1}, {x: 2}]│[{name: a}, {x: 1}, {name: b}, {x: 2}, {name: c}]│
├────────────────┼─────────────────────────────────────────────────┤
│[{x: 1}, {x: 5}]│[{name: a}, {x: 1}, {name: b}, {x: 5}, {name: c}]│
└────────────────┴─────────────────────────────────────────────────┘
```

### Query starting from a specific point - allShortestPaths

```
MATCH
  (a {name: 'a'})-[:REL]->(x),
  (d {name: 'd'})-[:REL]->(y),
  p=allShortestPaths( (x)-[r:REL*]->(y) )
RETURN r, p
ORDER BY (r[0]).x
```

```
╒════════╤══════════════════════════════╕
│r       │p                             │
╞════════╪══════════════════════════════╡
│[{x: 2}]│[{name: b}, {x: 2}, {name: c}]│
├────────┼──────────────────────────────┤
│[{x: 5}]│[{name: b}, {x: 5}, {name: c}]│
└────────┴──────────────────────────────┘
```

### Basic query without path variables

```
MATCH
  (a {name: 'a'})-[:REL]->(x),
  (d {name: 'd'})-[:REL]->(y),
  ( (x)-[r:REL*]->(y) )
RETURN r
```

```
╒════════════════╕
│r               │
╞════════════════╡
│[{x: 2}]        │
├────────────────┤
│[{x: 5}]        │
├────────────────┤
│[{x: 6}, {x: 7}]│
└────────────────┘
```

### Lessons learnt

* `shortestPath(...) does not support a minimal length different from 0 or 1`
* `allShortestPaths(...) does not support a minimal length different from 0 or 1`
* However, both support maximal lengths (0..any positive constant).
